<a target="_blank" href="https://colab.research.google.com/github/Datacompintensive/WignerCamp2025/blob/master/BasicProgramming/pandas_basics_solutions.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Pandas Self-Learning Notebook
This notebook is designed to help you learn the basics of Pandas. It covers reading CSV files with different separators, operations on DataFrames and Series, and writing to CSV files. Each section includes explanations, examples, and tasks with solutions.

## Introduction to Pandas
Pandas is a fast, powerful, flexible, and easy-to-use open-source data analysis and data manipulation library built on top of the Python programming language. It is ideal for working with structured data.

In [2]:
# Importing Pandas
import pandas as pd

## Reading CSV Files
Pandas provides functions to read data from various file formats, including CSV files. You can specify different separators such as commas, tabs, or any custom delimiter.

In [3]:
# Example: Reading a CSV file with comma-separated values
df = pd.read_csv('data.csv')  # Replace 'data.csv' with your file path
print(df.head())
print("\n\n")
display(df.head())
print("\n\n")
df.head(2)

      Name  Age  Salary  Experience
0    Alice   28   60000           5
1      Bob   35   75000           8
2  Charlie   22   50000           2
3    David   31   80000          10
4      Eve   29   62000           6

      Name  Age  Salary  Experience
0    Alice   28   60000           5
1      Bob   35   75000           8
2  Charlie   22   50000           2
3    David   31   80000          10
4      Eve   29   62000           6

    Name  Age  Salary  Experience
0  Alice   28   60000           5
1    Bob   35   75000           8

### Task 1
Read a CSV file named `data.tsv` where values are tab-separated. Display the first 4 rows.

In [4]:
# Task 1 Solution
df = pd.read_csv('data.tsv', sep='\t')  # Assuming 'data.tsv' is tab-separated
df.head(4)

      Name  Age  Salary  Experience
0    Alice   28   60000           5
1      Bob   35   75000           8
2  Charlie   22   50000           2
3    David   31   80000          10

## Operations on DataFrames and Series
Pandas allows various operations on DataFrames and Series, such as selecting columns, filtering rows, calculating statistics, and more.

In [4]:
# Example: Operations on DataFrames
# Selecting a column
column = df['Salary']

# Filtering rows
filtered_data = df[df['Salary'] > 10]

# Calculating statistics
mean_value = df['Salary'].mean()

# Displaying results
display(column.head(), filtered_data.head(), mean_value)

0    60000
1    75000
2    50000
3    80000
4     2000
Name: Salary, dtype: int64

      Name  Age  Salary  Experience
0    Alice   28   60000           5
1      Bob   35   75000           8
2  Charlie   22   50000           2
3    David   31   80000          10
4      Eve  296    2000           6

53400.0

### Task 2
Perform the following operations on the DataFrame `df`:
1. Select the column 'Age'
2. Filter rows where 'Salary' is greater than 50000
3. Calculate the median of the 'Experience' column

In [5]:
# Task 2 Solution
# 1. Selecting the 'Age' column
age_column = df['Age']

# 2. Filtering rows where 'Salary' is greater than 50000
high_salary_data = df[df['Salary'] > 50000]

# 3. Calculating the median of the 'Experience' column
median_experience = df['Experience'].median()

# Displaying results
age_column.head(), high_salary_data.head(), median_experience

(0     28
 1     35
 2     22
 3     31
 4    296
 Name: Age, dtype: int64,
     Name  Age  Salary  Experience
 0  Alice   28   60000           5
 1    Bob   35   75000           8
 3  David   31   80000          10,
 6.0)

## Writing to CSV Files
Pandas also provides functions to write DataFrame contents to CSV files.

In [6]:
# Example: Writing a DataFrame to a CSV file
df.to_csv('output.csv', index=False)  # Save DataFrame to 'output.csv' without index

### Task 3
Write the filtered data from Task 2 (where 'Salary' is greater than 50000) to a CSV file named `high_salary.csv`.

In [7]:
# Task 3 Solution
high_salary_data.to_csv('high_salary.csv', index=False)

## Conclusion
This notebook provided an introduction to Pandas, covering reading CSV files with different separators, operations on DataFrames and Series, and writing to CSV files. Practice these concepts to become more comfortable with Pandas.